package Part_13_Board;

import java.util.Scanner;

import Part_11_kiosk.So;

public class Home {



	public static void home() {
		// 게시판 구성
			Load.load(); // 배열 만들기/ 배열 초기화 등

			homeEnd:
			while (true) {
			TextBox.homeText();

			BoardObj.cmd = BoardObj.sc.next();
			switch (BoardObj.cmd) {
			//---------------------------------------------------------------------------------------------
			case "1": // 글 목록

			List.lest();
				
				
				
				
				
				
				
			
			
			break;
			//---------------------------------------------------------------------------------------------
			case "2": // 글읽기
				
				Content.content();
				
				
				
				
				
				
				
				
				
			
			
			break;
			//---------------------------------------------------------------------------------------------
			case "3": //글쓰기
				
				Writing.writing();
				
				
				
				
				
				
				
			
			
			break;
			//---------------------------------------------------------------------------------------------
			case "4": //글쓰기,수정하기
				Select.select();

				
				
				
				
				
				
				break;		

			//---------------------------------------------------------------------------------------------
			case "x": // 끄기
				
				
				
				
				
				
				
				
				
				
				
			break homeEnd;
			//---------------------------------------------------------------------------------------------
			}
		
		}

	}

}
